## Terraform: GitHub Runner :octocat:
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                            NAME                             |
|--------|-------------------------------------------------------------|
| add    | `module.github_runner.aws_cloudwatch_log_group.this`        |
|        | `module.github_runner.aws_codebuild_project.this`           |
|        | `module.github_runner.aws_codebuild_source_credential.this` |
|        | `module.github_runner.aws_codebuild_webhook.this`           |
|        | `module.github_runner.aws_iam_role.this`                    |
|        | `module.github_runner.aws_iam_role_policy.this`             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.github_runner.data.aws_iam_policy_document.this will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.github_runner.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/codebuild/cds-snc-status-statut"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.github_runner.aws_codebuild_project.this will be created
  + resource "aws_codebuild_project" "this" {
      + arn                  = (known after apply)
      + badge_enabled        = false
      + badge_url            = (known after apply)
      + build_timeout        = 30
      + description          = "Self-hosted GitHub runner for https://github.com/cds-snc/status-statut.git"
      + encryption_key       = (known after apply)
      + id                   = (known after apply)
      + name                 = "cds-snc-status-statut"
      + project_visibility   = "PRIVATE"
      + public_project_alias = (known after apply)
      + queued_timeout       = 5
      + service_role         = (known after apply)
      + tags                 = {
          + "CostCentre" = "SRE"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "SRE"
          + "Terraform"  = "true"
        }

      + artifacts {
          + encryption_disabled    = false
          + override_artifact_name = false
          + type                   = "NO_ARTIFACTS"
        }

      + cache {
          + type = "NO_CACHE"
        }

      + environment {
          + compute_type                = "BUILD_GENERAL1_SMALL"
          + image                       = "aws/codebuild/amazonlinux2-x86_64-standard:5.0"
          + image_pull_credentials_type = "CODEBUILD"
          + privileged_mode             = false
          + type                        = "LINUX_CONTAINER"
        }

      + logs_config {
          + cloudwatch_logs {
              + group_name  = "/aws/codebuild/cds-snc-status-statut"
              + status      = "ENABLED"
              + stream_name = "cds-snc-status-statut"
            }
        }

      + source {
          + git_clone_depth = 1
          + location        = "https://github.com/cds-snc/status-statut.git"
          + type            = "GITHUB"

          + git_submodules_config {
              + fetch_submodules = true
            }
        }
    }

  # module.github_runner.aws_codebuild_source_credential.this will be created
  + resource "aws_codebuild_source_credential" "this" {
      + arn         = (known after apply)
      + auth_type   = "PERSONAL_ACCESS_TOKEN"
      + id          = (known after apply)
      + server_type = "GITHUB"
      + token       = (sensitive value)
    }

  # module.github_runner.aws_codebuild_webhook.this will be created
  + resource "aws_codebuild_webhook" "this" {
      + build_type   = "BUILD"
      + id           = (known after apply)
      + payload_url  = (known after apply)
      + project_name = "cds-snc-status-statut"
      + secret       = (sensitive value)
      + url          = (known after apply)

      + filter_group {
          + filter {
              + exclude_matched_pattern = false
              + pattern                 = "WORKFLOW_JOB_QUEUED"
              + type                    = "EVENT"
            }
        }
    }

  # module.github_runner.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codebuild.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "CodeBuildRunner-cds-snc-status-statut"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.github_runner.aws_iam_role_policy.this will be created
  + resource "aws_iam_role_policy" "this" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "CodeBuildRunner-cds-snc-status-statut"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.github_runner.aws_cloudwatch_log_group.this"]
WARN - plan.json - main - Missing Common Tags: ["module.github_runner.aws_iam_role.this"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
